# Project 3 - Part 3 (Core)

Tijesunimi Odebode

In [1]:
import json
import pandas as pd
import numpy as np
import seaborn as sns


import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Load in the dataframe from project part 1 as basics:
basics = pd.read_csv('Data/basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,NaN,NaN,"Action,Crime"
1,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000,NaN,60.0,NaN
2,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140.0,"Drama,War"
3,tt0083060,movie,The Drive to Win,Sha Ou,0,2019,NaN,NaN,"Drama,Sport"
4,tt0089067,movie,El día de los albañiles 2,El día de los albañiles 2,0,2001,NaN,90.0,Comedy

In [3]:
#Drop NaN values in 'genres'
basics.dropna(subset=['genres'], inplace=True)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,NaN,NaN,"Action,Crime"
2,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140.0,"Drama,War"
3,tt0083060,movie,The Drive to Win,Sha Ou,0,2019,NaN,NaN,"Drama,Sport"
4,tt0089067,movie,El día de los albañiles 2,El día de los albañiles 2,0,2001,NaN,90.0,Comedy
5,tt0092960,movie,En tres y dos,En tres y dos,0,2004,NaN,102.0,Drama

In [4]:
#Drop NaN values in 'runtimeMinutes'
basics.dropna(subset=['runtimeMinutes'], inplace=True)
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
2,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140.0,"Drama,War"
4,tt0089067,movie,El día de los albañiles 2,El día de los albañiles 2,0,2001,NaN,90.0,Comedy
5,tt0092960,movie,En tres y dos,En tres y dos,0,2004,NaN,102.0,Drama
7,tt0102362,movie,Istota,Istota,0,2000,NaN,80.0,"Drama,Romance"
9,tt0110476,movie,Master i Margarita,Master i Margarita,0,2006,NaN,125.0,"Drama,Fantasy"
...,...,...,...,...,...,...,...,...,...
92833,tt9913872,movie,De la piel del Diablo,De la piel del Diablo,0,2019,NaN,75.0,Thriller
92834,tt9914192,movie,No Gogó do Paulinho,No Gogó do Paulinho,0,2020,NaN,98.0,Comedy
92835,tt9914286,movie,Sokagin Çocuklari,Sokagin Çocuklari,0,2019,NaN,98.0,"Drama,Family"
92839,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84.0,Thriller
92840,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123.0,Drama

## Transform:

In [5]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
2,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140.0,"Drama,War","[Drama, War]"
4,tt0089067,movie,El día de los albañiles 2,El día de los albañiles 2,0,2001,NaN,90.0,Comedy,[Comedy]
5,tt0092960,movie,En tres y dos,En tres y dos,0,2004,NaN,102.0,Drama,[Drama]
7,tt0102362,movie,Istota,Istota,0,2000,NaN,80.0,"Drama,Romance","[Drama, Romance]"
9,tt0110476,movie,Master i Margarita,Master i Margarita,0,2006,NaN,125.0,"Drama,Fantasy","[Drama, Fantasy]"
...,...,...,...,...,...,...,...,...,...,...
92833,tt9913872,movie,De la piel del Diablo,De la piel del Diablo,0,2019,NaN,75.0,Thriller,[Thriller]
92834,tt9914192,movie,No Gogó do Paulinho,No Gogó do Paulinho,0,2020,NaN,98.0,Comedy,[Comedy]
92835,tt9914286,movie,Sokagin Çocuklari,Sokagin Çocuklari,0,2019,NaN,98.0,"Drama,Family","[Drama, Family]"
92839,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84.0,Thriller,[Thriller]
92840,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123.0,Drama,[Drama]

In [6]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
2,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140.0,"Drama,War",Drama
2,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140.0,"Drama,War",War
4,tt0089067,movie,El día de los albañiles 2,El día de los albañiles 2,0,2001,NaN,90.0,Comedy,Comedy
5,tt0092960,movie,En tres y dos,En tres y dos,0,2004,NaN,102.0,Drama,Drama
7,tt0102362,movie,Istota,Istota,0,2000,NaN,80.0,"Drama,Romance",Drama
...,...,...,...,...,...,...,...,...,...,...
92834,tt9914192,movie,No Gogó do Paulinho,No Gogó do Paulinho,0,2020,NaN,98.0,Comedy,Comedy
92835,tt9914286,movie,Sokagin Çocuklari,Sokagin Çocuklari,0,2019,NaN,98.0,"Drama,Family",Drama
92835,tt9914286,movie,Sokagin Çocuklari,Sokagin Çocuklari,0,2019,NaN,98.0,"Drama,Family",Family
92839,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84.0,Thriller,Thriller
92840,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123.0,Drama,Drama

In [7]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [8]:
# Save just tconst and genres_split as new table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
2  tt0079644        Drama
2  tt0079644          War
4  tt0089067       Comedy
5  tt0092960        Drama
7  tt0102362        Drama

In [9]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [10]:
# make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres

          tconst  genre_id
2      tt0079644         7
2      tt0079644        24
4      tt0089067         5
5      tt0092960         7
7      tt0102362         7
...          ...       ...
92834  tt9914192         5
92835  tt9914286         7
92835  tt9914286         8
92839  tt9916270        23
92840  tt9916538         7

[90012 rows x 2 columns]

In [11]:
# Manually make dataframe with named cols from the .keys and .values
genres = pd.DataFrame({'Genre_Name': genre_map.keys(), 
                             'Genre_ID':genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Clean:

In [12]:
# drop "originalTitle" column
basics.drop(columns='originalTitle', inplace=True)
basics

,tconst,titleType,primaryTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
2,tt0079644,movie,November 1828,0,2001,NaN,140.0,"Drama,War","[Drama, War]"
4,tt0089067,movie,El día de los albañiles 2,0,2001,NaN,90.0,Comedy,[Comedy]
5,tt0092960,movie,En tres y dos,0,2004,NaN,102.0,Drama,[Drama]
7,tt0102362,movie,Istota,0,2000,NaN,80.0,"Drama,Romance","[Drama, Romance]"
9,tt0110476,movie,Master i Margarita,0,2006,NaN,125.0,"Drama,Fantasy","[Drama, Fantasy]"
...,...,...,...,...,...,...,...,...,...
92833,tt9913872,movie,De la piel del Diablo,0,2019,NaN,75.0,Thriller,[Thriller]
92834,tt9914192,movie,No Gogó do Paulinho,0,2020,NaN,98.0,Comedy,[Comedy]
92835,tt9914286,movie,Sokagin Çocuklari,0,2019,NaN,98.0,"Drama,Family","[Drama, Family]"
92839,tt9916270,movie,Il talento del calabrone,0,2020,NaN,84.0,Thriller,[Thriller]
92840,tt9916538,movie,Kuambil Lagi Hatiku,0,2019,NaN,123.0,Drama,[Drama]

In [13]:
# drop "isAdult" column
basics.drop(columns='isAdult', inplace=True)
basics

,tconst,titleType,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
2,tt0079644,movie,November 1828,2001,NaN,140.0,"Drama,War","[Drama, War]"
4,tt0089067,movie,El día de los albañiles 2,2001,NaN,90.0,Comedy,[Comedy]
5,tt0092960,movie,En tres y dos,2004,NaN,102.0,Drama,[Drama]
7,tt0102362,movie,Istota,2000,NaN,80.0,"Drama,Romance","[Drama, Romance]"
9,tt0110476,movie,Master i Margarita,2006,NaN,125.0,"Drama,Fantasy","[Drama, Fantasy]"
...,...,...,...,...,...,...,...,...
92833,tt9913872,movie,De la piel del Diablo,2019,NaN,75.0,Thriller,[Thriller]
92834,tt9914192,movie,No Gogó do Paulinho,2020,NaN,98.0,Comedy,[Comedy]
92835,tt9914286,movie,Sokagin Çocuklari,2019,NaN,98.0,"Drama,Family","[Drama, Family]"
92839,tt9916270,movie,Il talento del calabrone,2020,NaN,84.0,Thriller,[Thriller]
92840,tt9916538,movie,Kuambil Lagi Hatiku,2019,NaN,123.0,Drama,[Drama]

In [14]:
# drop "titleType" column
basics.drop(columns='titleType', inplace=True)
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
2,tt0079644,November 1828,2001,NaN,140.0,"Drama,War","[Drama, War]"
4,tt0089067,El día de los albañiles 2,2001,NaN,90.0,Comedy,[Comedy]
5,tt0092960,En tres y dos,2004,NaN,102.0,Drama,[Drama]
7,tt0102362,Istota,2000,NaN,80.0,"Drama,Romance","[Drama, Romance]"
9,tt0110476,Master i Margarita,2006,NaN,125.0,"Drama,Fantasy","[Drama, Fantasy]"
...,...,...,...,...,...,...,...
92833,tt9913872,De la piel del Diablo,2019,NaN,75.0,Thriller,[Thriller]
92834,tt9914192,No Gogó do Paulinho,2020,NaN,98.0,Comedy,[Comedy]
92835,tt9914286,Sokagin Çocuklari,2019,NaN,98.0,"Drama,Family","[Drama, Family]"
92839,tt9916270,Il talento del calabrone,2020,NaN,84.0,Thriller,[Thriller]
92840,tt9916538,Kuambil Lagi Hatiku,2019,NaN,123.0,Drama,[Drama]

In [15]:
# drop "genres" and other variants of genre columns
basics.drop(columns=['genres', 'genres_split'], inplace=True)
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
2,tt0079644,November 1828,2001,NaN,140.0
4,tt0089067,El día de los albañiles 2,2001,NaN,90.0
5,tt0092960,En tres y dos,2004,NaN,102.0
7,tt0102362,Istota,2000,NaN,80.0
9,tt0110476,Master i Margarita,2006,NaN,125.0
...,...,...,...,...,...
92833,tt9913872,De la piel del Diablo,2019,NaN,75.0
92834,tt9914192,No Gogó do Paulinho,2020,NaN,98.0
92835,tt9914286,Sokagin Çocuklari,2019,NaN,98.0
92839,tt9916270,Il talento del calabrone,2020,NaN,84.0
92840,tt9916538,Kuambil Lagi Hatiku,2019,NaN,123.0

## Upload Other Tables:

In [16]:
title_ratings = pd.read_csv('Data/ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

In [17]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_data.head()
# Select only required columns
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data

        imdb_id  revenue  budget certification
0             0      NaN     NaN           NaN
1     tt0015414      0.0     0.0           NaN
2     tt0113086      0.0     0.0           NaN
3     tt0116748      0.0     0.0           NaN
4     tt0118911      0.0     0.0           NaN
...         ...      ...     ...           ...
2364  tt8228424      0.0     0.0           NaN
2365  tt8929248      0.0     0.0           NaN
2366  tt9099724      0.0     0.0           NaN
2367  tt9501738      0.0     0.0           NaN
2368  tt9798698      0.0     0.0           NaN

[2369 rows x 4 columns]

In [18]:
tmdb_data = tmdb_data.loc[tmdb_data['imdb_id']!='0']
tmdb_data

        imdb_id  revenue  budget certification
1     tt0015414      0.0     0.0           NaN
2     tt0113086      0.0     0.0           NaN
3     tt0116748      0.0     0.0           NaN
4     tt0118911      0.0     0.0           NaN
5     tt0119866      0.0     0.0           NaN
...         ...      ...     ...           ...
2364  tt8228424      0.0     0.0           NaN
2365  tt8929248      0.0     0.0           NaN
2366  tt9099724      0.0     0.0           NaN
2367  tt9501738      0.0     0.0           NaN
2368  tt9798698      0.0     0.0           NaN

[2367 rows x 4 columns]

## Load:

In [19]:
# Create connection string using credentials 
connection_str = "mysql+pymysql://root:1986_Iyanuoluwa@localhost/movies"

In [20]:
engine = create_engine(connection_str)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [21]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: 
    create_database(connection_str)
else: 
    print('The database already exists.')

The database already exists.

In [22]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Integer(),
    'endYear':Float(),
    'runtimeMinutes':Float()}

In [23]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_ratings_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [24]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [25]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
title_len = genres['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genres_schema = {
    "Genre_Name":Text(title_len+1),
    'Genre_ID':Integer()}

In [26]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
title_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_data_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'revenue':Float(),
    'budget':Float()}

In [27]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)
title_ratings.to_sql('title_ratings',engine,dtype=title_ratings_schema,if_exists='replace',index=False)
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',index=False)
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',index=False)
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_data_schema,if_exists='replace',index=False)

In [28]:
# Set a Primary Key for each table.
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')
# engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [29]:
q = """SELECT * 
FROM title_basics
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst               primaryTitle  startYear endYear  runtimeMinutes
0  tt0079644              November 1828       2001    None           140.0
1  tt0089067  El día de los albañiles 2       2001    None            90.0
2  tt0092960              En tres y dos       2004    None           102.0
3  tt0102362                     Istota       2000    None            80.0
4  tt0110476         Master i Margarita       2006    None           125.0

In [30]:
q = """SELECT * 
FROM title_ratings
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

In [31]:
q = """SELECT * 
FROM title_genres
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0079644         7
1  tt0079644        24
2  tt0089067         5
3  tt0092960         7
4  tt0102362         7

In [32]:
q = """SELECT * 
FROM genres
LIMIT 5;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [33]:
q = """SELECT * 
FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id  revenue  budget certification
0  tt0015414      0.0     0.0          None
1  tt0079644      0.0     0.0          None
2  tt0089067      0.0     0.0          None
3  tt0113086      0.0     0.0          None
4  tt0114722      0.0     0.0          None

In [34]:
## check if tables created
q= '''SHOW TABLES;'''
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data